Revit 2026 API

# IConnector Interface

---

An interface which provides access to connector in Autodesk Revit MEP document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IConnector
```
```vb
Public Interface IConnector
```
```cpp
public interface class IConnector
```
```fsharp
type IConnector = interface end
```

The IConnector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CoordinateSystem | The coordinate system of the connector. |
|  | Domain | The domain of the connector. |
|  | Height | The height of the connector. |
|  | Origin | The location of the connector in family document. |
|  | Radius | The radius of the connector. |
|  | Shape | The shape of the connector. |
|  | Width | The width of the connector. |

This interface is shared by Connector, ConnectorElement.

#### Reference

Autodesk.Revit.DB Namespace